app/controllers/articles_controller.rb

  def create
    # @article = Article.new(article_params)
    @article = current_user.articles.build(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Shubh"], ["body", "ShubhBajpai\r\n"], ["created_at", "2021-08-19 08:34:18.211314"], ["updated_at", "2021-08-19 08:34:18.211314"], ["user_id", 3]]

  def correct_user
    @article = current_user.articles.find_by(id: params[:id]) #if aticle user_id is != to current user_id then it will be nill.
    redirect_to root_path, notice: "Not Authorized to Edit" if @article.nil?
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 3], ["id", 44], ["LIMIT", 1]]